Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/edc/PIC32MM0016GPL020.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="32xxxx" edc:desc="" edc:dosid="02610" edc:dsid="60001324" edc:informedby="DOS" edc:isextended="false" edc:masksetid="SABE" edc:name="PIC32MM0016GPL020" edc:procid="0x0345" edc:psid="60001364" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.625" edc:minvoltage="2.250"/>
    <edc:VDD edc:maxdefaultvoltage="3.625" edc:maxvoltage="3.625" edc:mindefaultvoltage="2.250" edc:minvoltage="2.250" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:erasepagesize="512" edc:haschecksum="true" edc:haslvp="true" edc:haslvp2="true" edc:pagesize="64">
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="5" edc:timeunits="ms"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="20" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="20" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="20" edc:timeunits="ms"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="20" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="64" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="64" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="512" edc:progop="rowerase"/>
    <edc:Wait edc:cfg="20" edc:erase="5" edc:lverase="20" edc:lvpgm="20" edc:pgm="20"/>
    <edc:Latches edc:cfg="64" edc:pgm="64" edc:rowerase="512"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="32xxxx" edc:name="32xxxx">
    <edc:MemTraits edc:addrinc="0x4" edc:locsize="0x4" edc:wordimpl="0xffffffff" edc:wordinit="0xffffffff" edc:wordsafe="0xffffffff" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet>
    <edc:InstructionSet edc:instructionsetid="micromips"/>
    <edc:InstructionSet edc:instructionsetid="mcuase"/>
  </edc:InstructionSet>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList edc:interruptcontrollerflavor="int_evic_v2" edc:shadowsetcount="2" ltx:defaultbaseaddr="0x9D000000">
    <edc:Interrupt edc:cname="CORE_TIMER" edc:desc="Core Timer" edc:irq="0"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_0" edc:desc="Core Software 0" edc:irq="1"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_1" edc:desc="Core Software 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="EXTERNAL_0" edc:desc="External 0" edc:irq="3"/>
    <edc:Interrupt edc:cname="EXTERNAL_1" edc:desc="External 1" edc:irq="4"/>
    <edc:Interrupt edc:cname="EXTERNAL_2" edc:desc="External 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="EXTERNAL_3" edc:desc="External 3" edc:irq="6"/>
    <edc:Interrupt edc:cname="EXTERNAL_4" edc:desc="External 4" edc:irq="7"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_A" edc:desc="PORT A Change Notification" edc:irq="8"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_B" edc:desc="PORT B Change Notification" edc:irq="9"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_C" edc:desc="PORT C Change Notification" edc:irq="10"/>
    <edc:Interrupt edc:cname="TIMER_1" edc:desc="Timer 1" edc:irq="11"/>
    <edc:Interrupt edc:cname="COMPARATOR_1" edc:desc="Comparator 1" edc:irq="12"/>
    <edc:Interrupt edc:cname="COMPARATOR_2" edc:desc="Comparator 2" edc:irq="13"/>
    <edc:Interrupt edc:cname="RTCC" edc:desc="Real Time Clock Alarm" edc:irq="14"/>
    <edc:Interrupt edc:cname="ADC" edc:desc="ADC Conversion Done" edc:irq="15"/>
    <edc:Interrupt edc:cname="CRC" edc:desc="CRC" edc:irq="16"/>
    <edc:Interrupt edc:cname="HLVD" edc:desc="HLVD" edc:irq="17"/>
    <edc:Interrupt edc:cname="CLC1" edc:desc="Logic Cell 1" edc:irq="18"/>
    <edc:Interrupt edc:cname="CLC2" edc:desc="Logic Cell 2" edc:irq="19"/>
    <edc:Interrupt edc:cname="SPI1_ERR" edc:desc="SPI 1 Error" edc:irq="20"/>
    <edc:Interrupt edc:cname="SPI1_TX" edc:desc="SPI 1 Transmission" edc:irq="21"/>
    <edc:Interrupt edc:cname="SPI1_RX" edc:desc="SPI 1 Reception" edc:irq="22"/>
    <edc:Interrupt edc:cname="UART1_RX" edc:desc="UART 1 Reception" edc:irq="23"/>
    <edc:Interrupt edc:cname="UART1_TX" edc:desc="UART 1 Transmission" edc:irq="24"/>
    <edc:Interrupt edc:cname="UART1_ERR" edc:desc="UART 1 Error" edc:irq="25"/>
    <edc:Interrupt edc:cname="CCP1" edc:desc="CCP 1 Input Capture or Output Compare" edc:irq="29"/>
    <edc:Interrupt edc:cname="CCT1" edc:desc="CCP 1 Timer" edc:irq="30"/>
    <edc:Interrupt edc:cname="CCP2" edc:desc="CCP 2 Input Capture or Output Compare" edc:irq="31"/>
    <edc:Interrupt edc:cname="CCT2" edc:desc="CCP 2 Timer" edc:irq="32"/>
    <edc:Interrupt edc:cname="CCP3" edc:desc="CCP 3 Input Capture or Output Compare" edc:irq="33"/>
    <edc:Interrupt edc:cname="CCT3" edc:desc="CCP 3 Timer" edc:irq="34"/>
    <edc:Interrupt edc:cname="SPI2_ERR" edc:desc="SPI 2 Error" edc:irq="37"/>
    <edc:Interrupt edc:cname="SPI2_TX" edc:desc="SPI 2 Transmission" edc:irq="38"/>
    <edc:Interrupt edc:cname="SPI2_RX" edc:desc="SPI 2 Reception" edc:irq="39"/>
    <edc:Interrupt edc:cname="UART2_RX" edc:desc="UART 2 Reception" edc:irq="40"/>
    <edc:Interrupt edc:cname="UART2_TX" edc:desc="UART 2 Transmission" edc:irq="41"/>
    <edc:Interrupt edc:cname="UART2_ERR" edc:desc="UART 2 Error" edc:irq="42"/>
    <edc:Interrupt edc:cname="NVM" edc:desc="NVM Program or Erase Complete" edc:irq="46"/>
    <edc:Interrupt edc:cname="PERFORMANCE_COUNTER" edc:desc="Core Performance Counter" edc:irq="47"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="6"/>
  <edc:ProjectionTable edc:ksegmask="0xFF000000">
    <edc:Projection edc:ksegval="0x7D000000" edc:ptovop="XOR" edc:ptovval="0x60000000" edc:vtopop="XOR" edc:vtopval="0x60000000"/>
    <edc:Projection edc:ksegval="0x7F000000" edc:ptovop="XOR" edc:ptovval="0x7F000000" edc:vtopop="XOR" edc:vtopval="0x7F000000"/>
    <edc:Projection edc:ksegval="0x80000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9D000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9F000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xA0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBD000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBF000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xBF000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
  </edc:ProjectionTable>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="zero" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="zero" edc:nmmrflags="St" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="at" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="at" edc:nmmrflags="St" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="at" edc:desc="" edc:mask="0xffffffff" edc:name="at" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="v0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="v0" edc:nmmrflags="SEt" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="v0" edc:desc="" edc:mask="0xffffffff" edc:name="v0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="v1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="v1" edc:nmmrflags="SEt" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="v1" edc:desc="" edc:mask="0xffffffff" edc:name="v1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
