Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/edc/PIC32MM0016GPL020.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="k0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="k0" edc:nmmrflags="St" edc:nmmrid="104" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="k0" edc:desc="" edc:mask="0xffffffff" edc:name="k0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="k1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="k1" edc:nmmrflags="St" edc:nmmrid="108" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="k1" edc:desc="" edc:mask="0xffffffff" edc:name="k1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="gp" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="gp" edc:nmmrflags="St" edc:nmmrid="112" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="gp" edc:desc="" edc:mask="0xffffffff" edc:name="gp" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="sp" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="sp" edc:nmmrflags="SEt" edc:nmmrid="116" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="sp" edc:desc="" edc:mask="0xffffffff" edc:name="sp" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="fp" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="fp" edc:nmmrflags="St" edc:nmmrid="120" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="fp" edc:desc="" edc:mask="0xffffffff" edc:name="fp" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ra" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ra" edc:nmmrflags="SEt" edc:nmmrid="124" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ra" edc:desc="" edc:mask="0xffffffff" edc:name="ra" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UserLocal" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="UserLocal" edc:nmmrflags="0b" edc:nmmrid="400" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USERLOCAL" edc:desc="" edc:mask="0xffffffff" edc:name="USERLOCAL" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="--n-------------------------nnnn" edc:cname="HWREna" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0-------------------------0000" edc:name="HWREna" edc:nmmrflags="0t" edc:nmmrid="156" edc:nzwidth="0x20" edc:por="--0-------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0xf" edc:name="Mask" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:SFRFieldDef edc:cname="ULR" edc:desc="" edc:mask="0x1" edc:name="ULR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadVAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="BadVAddr" edc:nmmrflags="0t" edc:nmmrid="160" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadVAddr" edc:desc="" edc:mask="0xffffffff" edc:name="BadVAddr" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
