Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/edc/PIC32MM0016GPL020.PIC
      <edc:SFRDef edc:_addr="0x1F802790" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnn--nnn--n-nnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xfffff397" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xxx--x-xxx" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="----------------xxxx--xxx--x-xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB12" edc:desc="" edc:mask="0x1" edc:name="CNSTATB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB15" edc:desc="" edc:mask="0x1" edc:name="CNSTATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027A0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnn--nnn--n-nnn" edc:cname="CNEN1B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0f397" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--000--0-000" edc:name="CNEN1B" edc:nzwidth="0x20" edc:por="----------------0000--000--0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE1B0" edc:desc="" edc:mask="0x1" edc:name="CNIE1B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B1" edc:desc="" edc:mask="0x1" edc:name="CNIE1B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B2" edc:desc="" edc:mask="0x1" edc:name="CNIE1B2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B4" edc:desc="" edc:mask="0x1" edc:name="CNIE1B4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B7" edc:desc="" edc:mask="0x1" edc:name="CNIE1B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B8" edc:desc="" edc:mask="0x1" edc:name="CNIE1B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B9" edc:desc="" edc:mask="0x1" edc:name="CNIE1B9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B12" edc:desc="" edc:mask="0x1" edc:name="CNIE1B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B13" edc:desc="" edc:mask="0x1" edc:name="CNIE1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B14" edc:desc="" edc:mask="0x1" edc:name="CNIE1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B15" edc:desc="" edc:mask="0x1" edc:name="CNIE1B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027B0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnn--nnn--n-nnn" edc:cname="CNFB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0f397" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--000--0-000" edc:name="CNFB" edc:nzwidth="0x20" edc:por="----------------0000--000--0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFB0" edc:desc="" edc:mask="0x1" edc:name="CNFB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB1" edc:desc="" edc:mask="0x1" edc:name="CNFB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB2" edc:desc="" edc:mask="0x1" edc:name="CNFB2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFB4" edc:desc="" edc:mask="0x1" edc:name="CNFB4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFB7" edc:desc="" edc:mask="0x1" edc:name="CNFB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB8" edc:desc="" edc:mask="0x1" edc:name="CNFB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB9" edc:desc="" edc:mask="0x1" edc:name="CNFB9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFB12" edc:desc="" edc:mask="0x1" edc:name="CNFB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB13" edc:desc="" edc:mask="0x1" edc:name="CNFB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB14" edc:desc="" edc:mask="0x1" edc:name="CNFB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB15" edc:desc="" edc:mask="0x1" edc:name="CNFB15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027C0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnn--nnn--n-nnn" edc:cname="SR0B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0f397" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="----------------0000--000--0-000" edc:name="SR0B" edc:nzwidth="0x20" edc:por="----------------0000--000--0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0B0" edc:desc="" edc:mask="0x1" edc:name="SR0B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B1" edc:desc="" edc:mask="0x1" edc:name="SR0B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B2" edc:desc="" edc:mask="0x1" edc:name="SR0B2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B4" edc:desc="" edc:mask="0x1" edc:name="SR0B4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B7" edc:desc="" edc:mask="0x1" edc:name="SR0B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B8" edc:desc="" edc:mask="0x1" edc:name="SR0B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B9" edc:desc="" edc:mask="0x1" edc:name="SR0B9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B12" edc:desc="" edc:mask="0x1" edc:name="SR0B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B13" edc:desc="" edc:mask="0x1" edc:name="SR0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B14" edc:desc="" edc:mask="0x1" edc:name="SR0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B15" edc:desc="" edc:mask="0x1" edc:name="SR0B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027D0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnn--nnn--n-nnn" edc:cname="SR1B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0f397" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="----------------0000--000--0-000" edc:name="SR1B" edc:nzwidth="0x20" edc:por="----------------0000--000--0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1B0" edc:desc="" edc:mask="0x1" edc:name="SR1B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B1" edc:desc="" edc:mask="0x1" edc:name="SR1B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B2" edc:desc="" edc:mask="0x1" edc:name="SR1B2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1B4" edc:desc="" edc:mask="0x1" edc:name="SR1B4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1B7" edc:desc="" edc:mask="0x1" edc:name="SR1B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B8" edc:desc="" edc:mask="0x1" edc:name="SR1B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B9" edc:desc="" edc:mask="0x1" edc:name="SR1B9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1B12" edc:desc="" edc:mask="0x1" edc:name="SR1B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B13" edc:desc="" edc:mask="0x1" edc:name="SR1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B14" edc:desc="" edc:mask="0x1" edc:name="SR1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B15" edc:desc="" edc:mask="0x1" edc:name="SR1B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8027E0" edc:offset="0x420"/>
      <edc:SFRDef edc:_addr="0x1F802C00" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="--------------------n-----------" edc:cname="PMDCON" edc:desc="" edc:impl="0x800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-----------" edc:name="PMDCON" edc:nzwidth="32" edc:por="--------------------0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C10" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="-----------n-------n-----------n" edc:cname="PMD1" edc:desc="" edc:impl="0x101001" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------0-------0-----------0" edc:name="PMD1" edc:nzwidth="32" edc:por="-----------0-------0-----------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="VREFMD" edc:desc="" edc:mask="0x1" edc:name="VREFMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="HLVDMD" edc:desc="" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C20" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="------nn----------------------nn" edc:cname="PMD2" edc:desc="" edc:impl="0x3000003" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00----------------------00" edc:name="PMD2" edc:nzwidth="32" edc:por="------00----------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="22"/>
            <edc:SFRFieldDef edc:cname="CLC1MD" edc:desc="" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C30" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="---------------------nnn--------" edc:cname="PMD3" edc:desc="" edc:impl="0x700" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------000--------" edc:name="PMD3" edc:nzwidth="32" edc:por="---------------------000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
